package com.itheima.collectionDemo;

public class Test2 {
    public static void main(String[] args) {
        /*
          什么是数据结构？
          数据结构：数据结构是一组元素的集合，这些元素可以按顺序或无序的进行存储和访问。

          各种数据结构的特点和作用是什么样的？
          1.数组：内存连续区域，查询快，增删慢
            数组是一组按一定顺序排列的元素，数组中的元素个数是固定的，并且只能存储一种数据类型。

          2.链表：元素是游离的，查询慢，增删快，但是查询首尾操作极快。
            链表是一组通过指针连接的元素，链表可以存储任意数据类型，并且可以动态改变大小。

          3. 栈是一种特殊的线性表，其特点是：后进先出，先进后出。
              - 插入操作（入栈/压栈，push）只能在栈顶进行
              - 删除操作（出栈/弹栈，pop）只能在栈顶进行

          4.队列是一种特殊的线性表，其特点是：先进先出，后进后出
              - 插入操作（入队）只能在队列的一端进行——称为队尾（rear）
              - 删除操作（出队）只能在队列的另一端进行——称为队头（front）

         */


    }
}
